JoonDong2/nRF51/noise_detector/examples/ble_peripheral/ble_app_nds/main.c
        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}

#ifdef BLE_DFU_SUPPORT
/**@brief Function for handling Device Firmware Update events.
 *
 * @param[in] p_dfu  Structure used to identify the Device Firmware Update service.
 * @param[in] p_evt  Device Firmware Update event.
 */
static void ble_dfu_evt_handler(ble_dfu_t * p_dfu, ble_dfu_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case BLE_DFU_EVT_INDICATION_DISABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is disabled\r\n");
            break;

        case BLE_DFU_EVT_INDICATION_ENABLED:
            NRF_LOG_INFO("Indication for BLE_DFU is enabled\r\n");
            break;

        case BLE_DFU_EVT_ENTERING_BOOTLOADER:
            NRF_LOG_INFO("Device is entering bootloader mode!\r\n");
            break;
        default:
            NRF_LOG_INFO("Unknown event from ble_dfu\r\n");
            break;
    }
}
#endif

/**@brief Function for handling Noise Detector events.
 *
 * @param[in] p_nds  Structure used to identify the Noise Detector service.
 * @param[in] p_evt  Noise Detector events.
 */
static uint32_t ble_nds_evt_handler(ble_nds_t * p_nds, ble_nds_evt_t * p_evt) {
	uint32_t err_code = NRF_SUCCESS;

	switch (p_evt->evt_type)
	{
		case BLE_DNV_EVT_NOTIFICATION_DISABLED:
			NRF_LOG_INFO("Indication for BLE_DNV is disabled\r\n");
			break;
		case BLE_DNV_EVT_NOTIFICATION_ENABLED:
			NRF_LOG_INFO("Indication for BLE_DNV is enabled\r\n");
			break;
		case BLE_NDCP_EVT_INDIFICATION_DISABLED:
			NRF_LOG_INFO("Indication for BLE_NDCP is disabled\r\n");
			break;
		case BLE_NDCP_EVT_INDIFICATION_ENABLED:
			NRF_LOG_INFO("Indication for BLE_NDCP is enabled\r\n");
			break;
		case BLE_NDCP_EVT_NOISE_DETECTOR_TIMER_DISABLE_REQUESTED:
		    // Noise detector timer stop
			nrf_gpio_pin_set(AMPLIFIER_SWITCH_PIN);
		    err_code = app_timer_stop(m_noise_detector_timer_id);
		    NRF_LOG_INFO("Noise Detector is disabled\r\n");
			break;
		case BLE_NDCP_EVT_NOISE_DETECTOR_TIMER_ENABLE_REQUESTED:
			// Noise detector timer start
			nrf_gpio_pin_clear(AMPLIFIER_SWITCH_PIN);
		    err_code = app_timer_start(m_noise_detector_timer_id, NOISE_DETECTOR_MEAS_INTERVAL, NULL);
		    NRF_LOG_INFO("Noise Detector is enabled\r\n");
			break;
	}
	return err_code;
}

/* @brief Function for changing adc configuration to detect both battery level and noise detector.
 *
 * @param[in] is_battery_level_checking		if true, setting for battery level.
 */
static void adc_config(bool is_battery_level_checking)
{
	nrf_adc_config_t config;

	if(is_battery_level_checking)
	{
		// setting ADC range from 0 to 1.2V and resolution to 8bits
		config.resolution = ADC_CONFIG_RES_8bit;
		config.scaling = NRF_ADC_CONFIG_SCALING_INPUT_FULL_SCALE;
		config.reference = ADC_CONFIG_REFSEL_VBG;
	}
	else
	{
		// setting ADC range from 0 to 1.8V and resolution to 8bits
		config.resolution = ADC_CONFIG_RES_8bit;
		config.scaling = NRF_ADC_CONFIG_SCALING_INPUT_TWO_THIRDS;
		config.reference = ADC_CONFIG_REFSEL_VBG;
	}
	nrf_adc_configure(&config);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code;

    // Prepare wakeup buttons.
    err_code = bsp_custom_1_btn_ble_setup_sleep_button();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

static uint8_t calculate_battery_level_64_resolution(int32_t battery_voltage, uint32_t* err_code)
{
	*err_code = NRF_SUCCESS;

	battery_voltage -= MIN_BATTERY_VOLTAGE; // 210 - 64 = 146

	if(battery_voltage > 48) // 64 - 49(16) : 100% - 15%
	{
		if(battery_voltage > 63)
			return 100;

		battery_voltage -= 48;
		return 15 + (((battery_voltage << 6) + (battery_voltage << 4) + (battery_voltage << 2) + battery_voltage) >> 4); // 15 + (battery_voltage x 85) ÷ 16
	}
	else if(battery_voltage > 16) // 48 - 17(32) : 15% - 2%
	{
		battery_voltage -= 16;
		return 2 + (((battery_voltage << 3) + (battery_voltage << 2) + battery_voltage) >> 5); // 2 + (battery_voltage x 13) ÷ 32
	}
	else if(battery_voltage > 0) // 16 - 1(16) : 2% - 0%
	{
		return (battery_voltage << 1) >> 4; // (battery_voltage x 2) ÷ 16
	}
	else // battery_voltage == 0
	{
		*err_code = NRF_ERROR_RESOURCES; // It means battery is discharged.
		return 0;
	}
}

/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t 	err_code;
    static uint32_t battery_voltage_buffer[BATTERY_VOLTAGE_AVERAGE_COUNT];
    static uint8_t buffer_index;
    int8_t		battery_level;

    adc_config(true);
    battery_voltage_buffer[buffer_index++] = nrf_adc_convert_single(BATTERY_LEVEL_INPUT) & 0xFF;
    m_is_battery_level_checked = true;
    NRF_LOG_INFO("battery_voltage_buffer[%d] = %d\r\n", buffer_index-1, battery_voltage_buffer[buffer_index-1]);

    if(buffer_index == BATTERY_VOLTAGE_AVERAGE_COUNT)
    {
    	int32_t tmp = 0;

    	buffer_index = 0;

    	for(int i=0; i<BATTERY_VOLTAGE_AVERAGE_COUNT; i++)
    	{
    		tmp += battery_voltage_buffer[i];
    	}

    	// TODO
    	battery_level = calculate_battery_level_64_resolution(tmp >> 2, &err_code); // tmp ÷ 4
    	//battery_level = tmp >> 2; // tmp ÷ 4
    	NRF_LOG_INFO("battery_level = %d\r\n", tmp);

    	if(err_code != NRF_SUCCESS)
    		sleep_mode_enter();

    	err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    	if ((err_code != NRF_SUCCESS) &&
    			(err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
    	{
    		APP_ERROR_HANDLER(err_code);
    	}
    }
}

