JoonDong2/nRF51/noise_detector/examples/ble_peripheral/ble_app_nds/main.c
/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

static void detected_noise_value_update()
{
	uint32_t err_code = NRF_SUCCESS;
	static uint8_t detected_value_buffer[MAX_DETECTED_NOISE_VALUE_LEN];

	// configure only when battery level ADC completed.
	if(m_is_battery_level_checked)
	{
		adc_config(!m_is_battery_level_checked);
		m_is_battery_level_checked = false;
	}

	detected_value_buffer[m_nds.cur_index++] = nrf_adc_convert_single(NOISE_DETECTOR_INPUT) & 0xFF;

	if(m_nds.cur_index == m_nds.max_dnv_len)
	{
		m_nds.cur_index = 0;
		// TODO : 문제 없나?
		m_nds.p_dnv_buffer = detected_value_buffer;
		err_code = ble_nds_detected_noise_value_broadcast(&m_nds);
	}

	NRF_LOG_INFO("ble_nds_detected_noise_value_broadcast err_code = %x\r\n", err_code);
	if ((err_code != NRF_SUCCESS) &&
			(err_code != NRF_ERROR_BUSY) &&
			(err_code != NRF_ERROR_INVALID_STATE) &&
			(err_code != BLE_ERROR_NO_TX_PACKETS) &&
			(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
	{
		APP_ERROR_HANDLER(err_code);
	}
}

static void noise_detector_meas_timeout_handler(void *p_context)
{
	UNUSED_PARAMETER(p_context);
	//NRF_LOG_INFO("noise_detector_meas_timeout_handler\r\n");
	detected_noise_value_update();
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_noise_detector_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                noise_detector_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    //err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

static void services_init(void)
{
	uint32_t         err_code;
    ble_nds_init_t   nds_init;
    ble_bas_init_t   bas_init;
    //ble_dis_init_t   dis_init;
#ifdef BLE_DFU_SUPPORT
    ble_dfu_init_t dfus_init;
#endif

	// Initialize Noise Detector Service
    memset(&nds_init, 0, sizeof(nds_init));

    nds_init.evt_handler        = ble_nds_evt_handler;
    nds_init.error_handler		= NULL;
    nds_init.max_dnv_len		= MAX_DETECTED_NOISE_VALUE_LEN;

    // setting GAP attribute security requirement for Detected Noise Value characteristic.
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&nds_init.nds_dnv_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&nds_init.nds_dnv_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&nds_init.nds_dnv_attr_md.write_perm);

    // setting GAP attribute security requirement for Noise Detector Control Point.
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&nds_init.nds_ndcp_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&nds_init.nds_ndcp_attr_md.write_perm);

    err_code = ble_nds_init(&m_nds, &nds_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    nrf_delay_ms(200); // waiting for charging capacitor... fMAX = 6.5Hz
    adc_config(true);
    bas_init.initial_batt_level = calculate_battery_level_64_resolution(nrf_adc_convert_single(BATTERY_LEVEL_INPUT) & 0xFF, &err_code);
    //bas_init.initial_batt_level = nrf_adc_convert_single(BATTERY_LEVEL_INPUT) & 0xFF; // TODO
    m_is_battery_level_checked = true;
    if(err_code != NRF_SUCCESS)
        	sleep_mode_enter();

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    /*memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);*/

#ifdef BLE_DFU_SUPPORT
    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

